app/controllers/movies_controller.rb

  def index
    unless session[:redirect]
      if params[:order].is_a?(String)
         @hilite = params[:order]
         session[:order] = @hilite
         session[:redirect] = true
      elsif params[:order].is_a?(Hash)
      	 @hilite = params[:order].keys.first
         session[:order] = @hilite
         session[:redirect] = true
      end
      if params[:ratings]
         session[:ratings] = params[:ratings]
         session[:redirect] = true
      end
    else
      session[:redirect] = false
    end
    @all_ratings = Movie.ratings
    if session[:order] and session[:ratings]
      @movies = Movie.where(rating: session[:ratings].keys).order("#{session[:order]} ASC")
      @hilite = session[:order]
    elsif session[:ratings]
      @movies = Movie.where(rating: session[:ratings].keys)
    elsif session[:order]
      @movies = Movie.all(order: "#{session[:order]} ASC")
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY title= ASC
SELECT "movies".* FROM "movies" ORDER BY {"{:value=>\"title\"}"=>""} ASC